Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: Quants ordinadors hem de comprar?
es_es: ¿Cuántos ordenadores tenemos que comprar?

source: Queda clar que els mòduls d'anàlisi i de generació en aquests sistemes són més complexos que en el cas de transferència (ja que han de fer transformacions cap a estructures lingüísticament neutrals), però també és clar l'avantatge del sistema d'interlingua a l'hora d'afegir-hi la llengua $L_4$: només cal dissenyar dos mòduls nous, $A'_4$ i $G'_4$, i per a dissenyar-los només necessitem una persona que conega bé la llengua $L_4$ i la interlingua $I$ que usa el sistema.
es_es: Queda claro que los módulos de análisis y de generación en estos sistemas son más complejos que en el caso de transferencia (puesto que tienen que hacer transformaciones hacia estructuras lingüísticamente neutrales), pero también está claro la ventaja del sistema de interlingua a la hora de añadir la lengua $L_4$: sólo hay que diseñar dos módulos nuevos, $A'_4$ y $G'_4$, y para diseñarlos sólo necesitamos una persona que conozca bien la lengua $L_4$ y la interlingua $I$ que usa el sistema.

source: Queda, a més, per determinar, en els casos en què es pot aplicar més d'una regla, quina s'hi ha d'aplicar abans; en una oració llarga i amb moltes regles disponibles, açò pot ser un problema greu.
es_es: Queda, además, por determinar, en los casos en los que se puede aplicar más de una regla, cuál tiene que aplicarse antes; en una oración larga y con muchas reglas disponibles, esto puede ser un problema grave.

source: Qui postedita produeix una traducció.
es_es: Quien postedita produce una traducción.

source: Quin dels següents no és un avantatge dels llenguatges controlats?
es_es: ¿Cuál de los siguientes no es una ventaja de los lenguajes controlados?

source: Quin dels següents tipus de sistema de traducció automàtica faciliten més l'addició d'una nova llengua?
es_es: ¿Cuáles de los siguientes tipos de traducción automática facilitan más la adición de una nueva lengua?

source: Quin dels següents tipus de sistema de traducció automàtica tenen la fase de transferència més senzilla possible?
es_es: ¿Cuál de los siguientes tipos sistema de traducción automática tienen la fase de transferencia más sencilla posible?

source: Quin dels tres mòduls d'un sistema de traducció automàtica de transferència espanyol--anglés conté les regles que indiquen que el passat de bring és brought i que el plural de foot és feet?
es_es: ¿Cuál de los tres módulos de un sistema de traducción automática de transferencia español--inglés contiene las reglas que indican que el pasado de bring es brought y que el plural de foot es feet?

source: Quin dels tres mòduls d'un sistema de traducció automàtica indirecta per transferència és monolingüe i tracta amb la llengua meta?
es_es: ¿Cuál de los tres módulos de un sistema de traducción automática indirecta por transferencia es monolingüe y trata con la lengua meta?

source: Quin tipus de sistema de traducció automàtica per transferència analitza els textos originals fins arribar a categories com ara agent, pacient, destinatari, instrument, experimentador, etc.?
es_es: ¿Qué tipo de sistema de traducción automática por transferencia analiza los textos originales hasta llegar a categorías como por ejemplo agente, paciente, destinatario, instrumento, experimentador, etc.?

source: Quina classe de sistema de traducció automàtica és LetTrans?
es_es: ¿Qué clase de sistema de traducción automática es LetTrans?

source: Quina de les següents situacions és absurda en traducció automàtica?
es_es: ¿Cuál de las siguientes situaciones es absurda en traducción automática?

source: Quina és l'alternativa estàndard a la preedició en un entorn de producció massiva de documentació multilingüe?
es_es: ¿Cuál es la alternativa estándar a la preedición en un en torno de producción masiva de documentación multilingüe?

source: Quina és l'operació inversa de l'anàlisi morfològica?
es_es: ¿Cuál es la operación inversa del análisis morfológico?

source: Quina?
es_es: ¿Cuál?

source: Quines de les següents representacions intermèdies son més costoses d'obtenir a partir de les frases?
es_es: ¿Cuáles de las siguientes representaciones intermedias son más costosas de obtener a partir de las frases?

source: Quines són les fases bàsiques d'un sistema de traducció automàtica indirecta?
es_es: ¿Cuáles son las fases básicas de un sistema de traducción automática indirecta?

source: Què diríeu d'aquest sistema?
es_es: ¿Qué diríais de este sistema?

source: Què hem de fer?
es_es: ¿Qué tenemos que hacer?

source: Què és la traducció?
es_es: ¿Qué es la traducción?

source: Qüestions i exercicis
es_es: Preguntas y ejercicios

source: Raoneu breument la resposta.
es_es: Razonad brevemente la respuesta.

source: Regles:
es_es: Reglas:

source: Resultat correcte.
es_es: Resultado correcto.

source: S'assumeix que el model de llengua s'aprén de textos naturals i gramaticalment correctes en LM.
es_es: Se asume que el modelo de lengua se aprende de textos naturales y gramaticalmente correctos en LM.

source: S'assumeix que el text està ja segmentat en mots, operació que pot no ser trivial en alguns idiomes com ara el japonés o el xinès, que no usen espais en blanc per a separar els mots.
es_es: Se asume que el texto está ya segmentado en palabras, operación que puede no ser trivial en algunos idiomas como por ejemplo el japonés o el chino, que no usan espacios en blanco para separar las palabras.

source: S'assumeix que les primeres lletres del mot en són l'arrel i, per tant, determinen el lema, i que les últimes lletres determinen la forma gramatical.
es_es: Se asume que las primeras letras de la palabra son la raíz y, por lo tanto, determinan el lema, y que las últimas letras determinan la forma gramatical.

source: S'ha de tenir en compte que el terme interlingua es pot referir també a una llengua internacional planificada ---no tan famosa com l'esperanto--- molt basada en el llatí i amb vocabulari europeu, i que no té res a veure amb la traducció automàtica.
es_es: Hay que tener en cuenta que el término interlingua se puede referir también a una lengua internacional planificada ---no tan famosa como el esperanto--- muy basada en el latín y con vocabulario europeo, y que no tiene nada que ver con la traducción automática.

source: S'ha de tenir en compte que escriure una gramàtica que cobrisca completament totes les possibles frases sintàcticament correctes d'una llengua és una tasca que està molt lluny de ser trivial; per això, els analitzadors han de ser robustos i ser capaços d'entregar anàlisis parcials o incompletes per a oracions que no estaven previstes.
es_es: Se tiene que tener en cuenta que escribir una gramática que cubra completamente todas las posibles frases sintácticamente correctas de una lengua es una tarea que está muy lejos de ser trivial; por ese motivo, los analizadores tienen que ser robustos y ser capaces de entregar análisis parciales o incompletos para oraciones que no estaban previstas.

source: S'ha de tenir en compte que hi ha característiques dels textos natius que poden no ser necessàries per a la comprensió.
es_es: Se debe que tener en cuenta que hay características de los textos nativos que pueden no ser necesarias para la comprensión.

source: S'hi indiquen les traduccions i, entre claudàtors, la regla aplicada en cada cas: Un $[_{R_4$ longe viage $]$} $$ Un viatge llarg Un $[_{R_4$ longe viages $]$} $$ *Un viatges llargs $[_{R_2$ Un viages longe $]$} $$ Uns viatges llargs $[_{R_4$ Longe viages $]$} $$ Viatges llargs $[_{R_1$ Un governamento $]$ non democratic} $$ Un govern no democràtic $[_{R_1$ Un governamentos $]$ non democratic} $$ *Uns governs no democràtic Tu $[_{R_4$ melior ideales $]$} $$ *El teu millors ideals Un $[_{R_4$ bon solution $]$} $$ *Un bona solució
es_es: Se indican las traducciones y, entre corchetes, la regla aplicada en cada caso: Un $[_{R_4$ longe viage $]$} $$ Un viatge llarg Un $[_{R_4$ longe viages $]$} $$ *Un viatges llargs $[_{R_2$ Un viages longe $]$} $$ Uns viatges llargs $[_{R_4$ Longe viages $]$} $$ Viatges llargs $[_{R_1$ Un governamento $]$ non democratic} $$ Un govern no democràtic $[_{R_1$ Un governamentos $]$ non democratic} $$ *Uns governs no democràtic Tu $[_{R_4$ melior ideales $]$} $$ *El teu millors ideals Un $[_{R_4$ bon solution $]$} $$ *Un bona solució

source: Sembla que reconeix la seqüència (1) { art}--{ subst} i propaga el nombre i el gènere del substantiu a l'adjectiu.
es_es: Parece que reconoce la secuencia (1) { art}--{ sust} y propaga el número y el género del sustantivo al adjetivo.

source: Sembla que reconeix la seqüència (2) { art}--{ subst}--{ adj} i propaga el nombre i el gènere del substantiu tant a l'article com a l'adjectiu, { Nos ofreció un buen postre} $$ { *Ens va oferir un bon postres}: No funciona.
es_es: Parece que reconoce la secuencia (2) { art}--{ sust}--{ adj} y propaga el número y el género del sustantivo tanto al artículo como el adjetivo, { Nos ofreció un buen postre} $$ { *Ens va oferir un bon postres}: No funciona.

source: Si demanàrem a una persona no experta que dissenyara un sistema de traducció automàtica, el primer disseny no seria molt diferent del que s'ha descrit.
es_es: Si pidiéramos a una persona no experta que diseñara un sistema de traducción automática, el primer diseño no sería muy diferente al que se ha descrito.

source: Si el cim de la pila és
es_es: Si la cumbre de la pila es

source: Si en el sistema anglés--espanyol de dalt separem les dades lingüístiques de cada un dels tres mòduls del programari que processa aquestes dades (dA\(_{en}\), dT\(_{en es}\), dG\(_{es}\)) podem definir un motor genèric de traducció (A, T, G) que val per a qualsevol parell de llengües: {0.5cm}{en} $$ {{0.75cm}{dA\(_{en}\)
es_es: Si en el sistema inglés--español de arriba separamos los datos lingüísticos de cada uno de los tres módulos del software que procesa estos datos (dA\(_{en}\), dT\(_{en es}\), dG\(_{es}\)) podemos definir un motor genérico de traducción (A, T, G) que vale para cualquier pareja de lenguas: {0.5cm}{en} $$ {{0.75cm}{dA\(_{en}\)

source: Si en una fàbrica de frigorífics s'usen sistemes de traducció automàtica per a traduir a moltes altres llengües els manuals dels nombrosos models que s'hi fabriquen (i que són molt similars entre ells), la solució més eficient per a evitar errors de traducció és{} regular la manera en què els autors escriuen els manuals.
es_es: Si en una fábrica de frigoríficos se usan sistemas de traducción automática para traducir a otras muchas lenguas los manuales de los numerosos modelos que se fabrican (y que son muy similares entre ellos), la solución más eficiente para evitar errores de traducción es{} regular la manera en la que los autores escriben los manuales.

source: Si enviem un document HTML a un servidor de traducció automàtica i després posteditem el resultat perquè siga una traducció acceptable de l'original abans de publicar-la, estem usant la traducció automàtica{} {} amb memòria de traducció.
es_es: Si enviamos un documento HTML a un servidor de traducción automática y después posteditamos el resultado para que sea una traducción aceptable del original antes de publicarla, estamos usando la traducción automática{} {} con memoria de traducción.

source: Si fóra un sistema de transferència seria necessària la participació d'experts bilingües en suahili i cada una de les quinze llengües que ja hi ha en el sistema.
es_es: Si fuera un sistema de transferencia sería necesaria la participación de expertos bilingües en suahili y cada una de las quince lenguas que ya hay en el sistema.

source: Si haguéreu de supervisar la construcció dels diccionaris d'un sistema de traducció automàtica, per a què us podrien servir aquestes constatacions estadístiques?
es_es: ¿Si hubiérais de supervisar la contrucción de los diccionarios de un sistema de traducción automática, para qué os pordrían servir estas constataciones estadísticas?

source: Si la frase és estructuralment ambigua (vegeu l'apartat ), té més d'un arbre d'anàlisi sintàctica: alguns analitzadors produeixen tots els arbres possibles; d'altres, n'elegeixen un (usant alguna estratègia de desambiguació sintàctica com les descrites en ).
es_es: Si la frase es estructuralmente ambigua (véase el apartado ), tiene más de un árbol de análisis sintáctico: algunos analizadores producen todos los árboles posibles; otros, eligen uno (usando alguna estrategia de desambiguación sintáctica como las descritas en ).

source: Si la traducció es fa mitjançant un sistema automàtic, quin ús n'està fent?
es_es: Si la traducción se hace mediante un sistema automático, ¿qué uso está haciendo?

source: Si no es pot aplicar un reordenament al primer mot pendent de processar, es tradueix aïlladament i es continua amb el següent mot.
es_es: Si no se puede aplicar un reordenamiento a la primera palabra pendiente de procesar, se traduce aisladamente y se continúa con la siguiente palabra.

source: Si s'aplica primer la regla $R_1$ a ``tall truck'' ja no podem aplicar-hi la $R_2$.
es_es: Si se aplica primero la regla $R_1$ a ``tall truck'' ya no podemos aplicar la $R_2$.

source: Si s'hi aplica primer la $R_2$ i després la $R_1$, s'obté la traducció correcta: ``conductor alt de camió''.
es_es: Si se aplica primero la $R_2$ y después la $R_1$, se obtiene la traducción correcta: ``conductor alto de camión''.

source: Si tenim ``tall gasoline truck driver'' (``conductor alt de camió de gasolina''), no hi ha cap ordre d'aplicació de $R_2$ i $R_1$ que done una traducció acceptable.
es_es: Si tenemos ``tall gasoline truck driver'' (``conductor alto de camión de gasolina''), no hay ningún orden de aplicación de $R_2$ i $R_1$ que dé una traducción aceptable.

source: Si un angloparlant usa el traductor automàtic portugués--anglés de |babelfish.altavista.com| per a llegir en línia el diari brasiler O Globo, està usant la traducció automàtica per a un propòsit d'assimilació d'informació.
es_es: Si un anglohablante usa el traductor automático--inglés de |babelfish.altavista.com| para leer en línea el diario brasileño O Globo, está usando la traducción automática para un propósito de asimilación de información.

source: Si una forma superficial té només una forma lèxica, però dues possibles traduccions a una altra llengua{} {} es tracta d'un mot homòfon.
es_es: Si una forma superficial tiene sólo una forma léxica, pero dos posibles traducciones a otra lengua{} {} se trata de una palabra homófona.

source: Si una oració té només una ambigüitat lèxica pura, té només un arbre únic d'anàlisi sintàctica.
es_es: Si una oración tiene sólo una ambigüedad léxica pura, tiene sólo un único árbol de análisis sintáctico.

source: Si volem afegir-hi una cinquena llengua perquè traduïsca en qualsevol sentit entre cinc llengües, quants mòduls nous cal escriure?
es_es: Si queremos añadir una quinta lengua para que traduzca en cualquier sentido entre cinco lenguas, ¿cuántos módulos nuevos hay que escribir?

source: Si, en canvi, tenim un sistema de TA per transferència sintàctica i suposem que la gramàtica conté les regles següents: {l} ${SN} {SG}{SN}$
es_es: Si, en cambio, tenemos un sistema de TA por transferencia sintáctica y suponemos que la gramática contiene las reglas siguientes: {|} ${SN} {SG}{SN}$

source: Sistemes basats en interlingua
es_es: Sistemas basados en interlingua

source: Sistemes de traducció automàtica basats en corpus
es_es: Sistemas de traducción automática basados en corpus

source: Solucions
es_es: Soluciones

source: Són especialment importants els resultats obtinguts a diverses empreses com Xerox on s'elimina quasi completament la postedició (vegeu la p. ) gràcies al control de la llengua origen (vegeu l'apartat ); això permet la traducció senzilla dels manuals tècnics en anglés de la companyia a un gran nombre d'idiomes (francés, alemany, italià, espanyol, portugués i llengües escandinaves).
es_es: Son especialmente importantes los resultados obtenidos en varias empresas como Xerox, donde se elimina casi por completo la postedición (véase la pag. ) gracias al control de la lengua origen (veáis el apartado ); esto permite la traducción sencilla de los manuales técnicos en inglés de la compañía a un gran número de idiomas (francés, alemán, italiano, español, portugués y lenguas escandinavas).

source: TEXT ORIGEN:
es_es: TEXTO ORIGEN:

source: També caldria parlar (ací o en el tema d'ambigüitat) de la impossibilitat de programar el coneixement intuïtiu dels professionals de la traducció (creences, expectatives) per a desfer l'ambigüitat, generar text.
es_es: También habría que hablar (aquí o en el tema de ambigüedad) de la imposibilidad de programar el conocimiento intuitivo de los profesionales de la traducción (creencias, expectativas) para deshacer la ambigüedad, generar texto.

source: També el 1976 apareix Metéo, desenvolupat per la Universitat de Montréal, que tradueix al francés els informes meteorològics.
es_es: También en 1976 aparece Metéo, desarrollado por la Universidad de Montréal, que traduce al francés los informes meteorológicos.

source: També hi ha llenguatges controlats no específicament dissenyats per a la traducció automàtica, com ara l'anglés simplificat ({ Simplified English}) de l'AECMA (Associació Europea d'Indústries Aeroespacials), que es caracteritza per ``una sintaxi senzilla, un nombre limitat de mots, un nombre limitat de significats ben definits per mot (normalment un), i un nombre limitat de categories lèxiques per mot (normalment una)'', amb ``l'objectiu de produir textos breus i no ambigus'' {AECMA07u}.
es_es: También hay lenguajes controlados que no están específicamente diseñados para la traducción automática, como el inglés simplificado ({ Simplified English}) del AECMA (Asociación Europea de Industrias Aeroespaciales), que se caracteriza por ``una sintaxis sencilla, un número limitado de palabras, un número limitado de significados bien definidos por palabra (normalmente uno), y un número limitado de categorías léxicas por palabra (normalmente una)", con ``el objetivo de producir textos breves y no ambiguos" {AECMA07u}.

source: Tenim un sistema basat en interlingua que tradueix entre 6 idiomes ($L_1$, $L_2$, , $L_6$) i volem incorporar l'idioma $L_7$.
es_es: Tenemos un sistema basado en interlingua que traduce entre 6 idiomas ($L_1$, $L_2$, , $L_6$) y queremos incorporar el idioma $L_7$.

source: Tenim un sistema de traducció automàtica multilingüe que tradueix en qualsevol direcció entre les llengües que considera.
es_es: Tenemos un sistema de traducción automática multilingüe que traduce en cualquier dirección entre las lenguas que considera.

source: Tenint en compte les llengües implicades, argumenteu a favor i en contra d'usar un sistema d'interlingua clàssic (amb anàlisi semàntica profunda) o un sistema de transferència, indicant en cada cas com haurien de ser les representacions intermèdies usades.
es_es: Teniendo en cuenta las lenguas implicadas, argumentad a favor y en contra de usar un sistema de interlingua clásico (con análisis semántico profundo) o un sistema de transferencia, indicando en cada caso cómo tendrían que ser las representaciones intermedias usadas.

source: Tinc notes abundants i textos sobre això; el problema és on els col·loquem sense refer completament el tema.}
es_es: Tengo notas abundantes y textos sobre esto; el problema es dónde los colocamos sin rehacer completamente el tema.}

source: Tipus de canvis (per exemple, català$$espanyol$$català): Canvi d'un mot per un sinònim per causa de l'elecció diferent d'equivalents en un sentit i en un altre, darrer$$último$$últim o fins i tot per un que no ho és, direcció$$dirección$$adreça.
es_es: Tipos de cambios (por ejemplo, catalán$$español$$catalán): Cambio de una palabra por un sinónimo por causa de la elección diferente de equivalentes en un sentido y en otro, darrer$$último$$últim o incluso por uno que no lo es, direcció$$dirección$$adreça.

source: Tot això permet representar l'analitzador morfològic com el que els matemàtics anomenen graf dirigit acíclic (GDA).
es_es: Todo esto permite representar el analizador morfológico como lo que los matemáticos llaman grafo dirigido acíclico (GDA).

source: Tot i això, alguns grups van continuar treballant a Canadà i a Europa i van aparéixer els primers sistemes que funcionaven; el 1970 el sistema Systran va començar a ser usat per la USAF (United States Air Force) i el 1976 per la Comissió de la Comunitat Europea.
es_es: Aún así, algunos grupos continuaron trabajando en Canadá y Europa, y aparecieron los primeros sistemas que funcionaban; en 1970 el sistema Systran empezó a ser usado por la USAF (United States Air Force) y en 1976 por la Comisión de la Comunitad Europea.

source: Tot i que els resultats no eren massa bons, el públic i la indústria van creure que en uns anys es podrien aconseguir traduccions automàtiques de qualitat de documents científics i tècnics.
es_es: Aunque los resultados no eran demasiado buenos, el público y la industria creyeron que en unos años se podrían conseguir traducciones automáticas de calidad de documentos científicos y técnicos.

source: Tot i que en els decennis dels 1930 i 1940 hi va haver alguns treballs precursors, és als primers cinquanta quan comença realment la recerca en TA en moltes universitats arreu del món, especialment als Estats Units.
es_es: A pesar de que en el decenio que va de 1930 a 1940 hubo algunos trabajos precursores, es a principios de los años cincuenta cuando empieza realmente la investigación en TA en muchas universidades de todo el mundo, especialmente en los Estados Unidos.

source: Tot i que la gran innovació dels noranta van ser els mètodes descrits adés, la recerca i el desenvolupament dels sistemes clàssics també va continuar: per exemple, el projecte Eurolang basat en el sistema de transferència Metal pot traduir de l'anglès al francés, alemany, italià i espanyol, i viceversa.
es_es: A pesar de que la gran innovación de los noventa fueron los métodos descritos antes, la investigación y el desarrollo de los sistemas clásicos también continuó: por ejemplo, el proyecto Eurolang basado en el sistema de transferencia Metal puede traducir del inglés al francés, alemán, italiano y español, y viceversa.

source: Tot i que s'esperava que la traducció resultant seria de gran qualitat, encara es preveia una gran quantitat de postedició.
es_es: A pesar de que se esperaba que la traducción resultante fuera de gran calidad, todavía se preveía una gran cantidad de postedición.

source: Tot i que sembla una tasca difícil per a un ordinador, els alineaments entre els mots es poden obtenir automàticament sense usar cap coneixement sobre les llengües dels textos a alinear mitjançat un procés iteratiu.
es_es: A pesar de que parece una tarea difícil para un ordenador, los alineamientos entre las palabras se pueden obtener automáticamente sin usar ningún conocimiento sobre las lenguas de los textos a alinear mediante un proceso iterativo.

source: Totes les tècniques de traducció automàtica descrites fins ara són de naturalesa deductiva, és a dir, estan basades en teories i coneixements lingüístics sobre la traducció.
es_es: Todas las técnicas de traducción automática descritas hasta ahora son de naturaleza deductiva, es decir, están basadas en teorías y conocimientos lingüísticos sobre la traducción.

source: Tothom accepta ja en aquest decenni la importància dels llenguatges controlats i els subllenguatges en la TA, com ja havien defensat els precursors de la TA durant el decenni dels cinquanta.
es_es: Todo el mundo acepta ya en esta década la importancia de los lenguajes controlados y los sublenguajes en la TA, como ya habían defendido los precursores de la TA durante la década de los cincuenta.
